; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v6)
		(pred_5 ?v8)
		(pred_3 ?v3)
		(pred_4 ?v3)
		(pred_2 ?v8 ?v3)
		(pred_1)
		(pred_6 ?v8))

   (:action op_1
       :parameters  (?v5 ?v2)
       :precondition (and (not-eq ?v5 ?v2) 
                          (pred_3 ?v5) (pred_3 ?v2) (pred_4 ?v5))
       :effect (and  (pred_4 ?v2)
		     (not (pred_4 ?v5))))


   (:action op_2
       :parameters (?v7 ?v1)
       :precondition  (and  (pred_5 ?v7) (pred_3 ?v1)
			    (pred_2 ?v7 ?v1) (pred_4 ?v1) (pred_1))
       :effect (and (pred_6 ?v7)
		    (not (pred_2 ?v7 ?v1)) 
		    (not (pred_1))))

   (:action op_3
       :parameters  (?v7  ?v1)
       :precondition  (and  (pred_5 ?v7) (pred_3 ?v1)
			    (pred_6 ?v7) (pred_4 ?v1))
       :effect (and (pred_2 ?v7 ?v1)
		    (pred_1)
		    (not (pred_6 ?v7)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_01 obj_06 obj_03 obj_07 
          obj_02 obj_04 obj_05 
)
(:init
(pred_3 obj_01)
(pred_3 obj_06)
(pred_3 obj_03)
(pred_3 obj_07)
(pred_5 obj_02)
(pred_5 obj_04)
(pred_5 obj_05)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(pred_1)
(pred_2 obj_02 obj_07)
(pred_2 obj_04 obj_07)
(pred_2 obj_05 obj_07)
(pred_4 obj_06)
)
(:goal
(and
(pred_2 obj_02 obj_07)
(pred_2 obj_04 obj_01)
(pred_2 obj_05 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_04 obj_01) (pred_4 obj_03))
    (sometime-before  (pred_2 obj_05 obj_03) (pred_4 obj_01))
  )
)
)

; plan
1. (op_1 obj_06 obj_07)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_07)
   goals met: 1 of 3
2. (op_2 obj_05 obj_07)
   deleted: (pred_2 obj_05 obj_07) (pred_1)
   added: (pred_6 obj_05)
   goals met: 1 of 3
3. (op_1 obj_07 obj_03)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_03)
   goals met: 1 of 3
4. (op_1 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_01)
   goals met: 1 of 3
5. (op_3 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_2 obj_05 obj_01) (pred_1)
   goals met: 1 of 3
6. (op_1 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 1 of 3
7. (op_2 obj_04 obj_07)
   deleted: (pred_2 obj_04 obj_07) (pred_1)
   added: (pred_6 obj_04)
   goals met: 1 of 3
8. (op_1 obj_07 obj_01)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_01)
   goals met: 1 of 3
9. (op_3 obj_04 obj_01)
   deleted: (pred_6 obj_04)
   added: (pred_2 obj_04 obj_01) (pred_1)
   goals met: 2 of 3
10. (op_2 obj_05 obj_01)
   deleted: (pred_2 obj_05 obj_01) (pred_1)
   added: (pred_6 obj_05)
   goals met: 2 of 3
11. (op_1 obj_01 obj_03)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_03)
   goals met: 2 of 3
12. (op_3 obj_05 obj_03)
   deleted: (pred_6 obj_05)
   added: (pred_2 obj_05 obj_03) (pred_1)
   goals met: 3 of 3
